app/Controllers/UserController.php

SELECT *
FROM `users`
WHERE `email` = 'test@gmail.com'
 LIMIT 1
---
    public function index()
    {

        helper(['form']);
        $data = [];

        if ($this->request->getMethod() == "post") {

            $rules = [
                "email" => "required|min_length[6]|max_length[50]|valid_email",
                "password" => "required|min_length[8]|max_length[255]|validateUser[email, password]",
            ];

            $passwordError = [
                "password" => ["validateUser" => "Email or Password does not match"]
            ];

            if (!$this->validate($rules, $passwordError)) {
                $data['validation'] = $this->validator;
                session()->destroy();
            } else {
                $model = new UserModel();
                $user = $model->where("email", $this->request->getPost("email"))->first();